{
    "dev-front-end":{
        "dev":{
            "javascript":{
                "framework":{
                    "angular":{
                        "description":"Angular (également appelé Angular 2+ pour le distinguer de son prédécesseur AngularJS) est un framework pour clients, open source, basé sur TypeScript et codirigé par l'équipe du projet « Angular » chez Google ainsi que par une communauté de particuliers et de sociétés. Angular est une réécriture complète d'AngularJS. Il permet la création d’applications Web et plus particulièrement d'applications Web monopages : des applications Web accessibles via une page Web unique qui permet de fluidifier l’expérience utilisateur et d’éviter les chargements de pages à chaque nouvelle action. Le framework est basé sur une architecture du type MVC et permet donc de séparer les données, le visuel et les actions pour une meilleure gestion des responsabilités. Selon l'enquête Stack Overflow auprès des développeurs, Angular est l'un des frameworks web les plus utilisés.",
                        "image":"data/img/angular.png"
                    },
                    "angular.js":{
                        "description":"AngularJS est un cadre open source populaire qui simplifie le développement web en créant des applications interactives à une page (SPA). Contrairement aux sites traditionnels qui chargent de nouvelles pages à chaque clic, les SPA offrent une expérience utilisateur plus fluide en mettant à jour le contenu sur la même page. AngularJS rend cela possible en transformant le HTML statique en contenu dynamique qui s’adapte aux interactions utilisateurs. Des fonctionnalités comme la liaison de données et l’injection de dépendances simplifient le développement, vous faisant gagner du temps et des efforts. Grâce à des mises à jour régulières et une grande communauté, AngularJS garantit que vos applications web restent modernes et efficaces.",
                        "image":"data/img/angularjs.png"
                    },
                    "ember.js":{
                        "description":"Ember.js est un framework open source JavaScript côté client utilisé pour développer des applications Web. Il permet de créer des applications JavaScript côté client en fournissant une solution complète qui contient la gestion des données et un flux d'application.",
                        "image":"data/img/ember.png"
                    },
                    "react.js":{
                        "description":"React, également connu sous le nom de React.js ou ReactJS, est une bibliothèque JavaScript open source conçue pour la création d’interfaces utilisateur ou UI (User Interface). Développée par Facebook en 2013, cette bibliothèque se concentre principalement sur le développement d’interfaces pour des applications web monopages. Elle permet aux développeurs de créer des composants réutilisables et interactifs qui peuvent maintenir leur état (state) sans avoir besoin de recharger la page.",
                        "image":"data/img/reactjs.png"
                    },
                    "JSF / Jakarta Faces":{
                        "description":"Jakarta Faces, anciennement Jakarta Server Faces et JavaServer Faces (JSF), est une spécification Java destinée à la création d’interfaces utilisateur basées sur des composants pour les applications web. [2] Il a été formalisé en tant que norme via le Java Community Process dans le cadre de la Java Platform, Enterprise Edition. C’est un framework web MVC qui simplifie la construction d’interfaces utilisateur (UI) pour les applications serveur en utilisant des composants UI réutilisables dans une page.",
                        "image":"data/img/jakarta.png"
                    },
                    "vue.js":{
                        "description":"Vue.js est une librairie JavaScript open source utilisée pour construire des interfaces utilisateur (UI) et des applications monopages (SPA – Single Page Applications). Créée par Evan You en 2014, elle a rapidement gagné en popularité en raison de sa facilité d’intégration avec d’autres projets et bibliothèques ainsi que pour sa souplesse et sa légèreté. Vue.js se concentre sur la couche de vue et peut être aisément adopté pour gérer la couche d’interaction dans des applications web.Vue.js fonctionne sur le modèle MVVM (Modèle-Vue-Modèle de Vue), permettant aux développeurs de séparer la logique métier des interfaces, favorisant ainsi la maintenance et la gestion de projets complexes. La réactivité est au cœur de Vue.js : à chaque fois qu’un état d’une application change, la vue se met automatiquement à jour pour refléter ce changement.",
                        "image":"data/img/vuejs.png"
                    },
                    "svelte":{
                        "description":"Svelte est un framework JavaScript moderne qui simplifie le développement d’applications web réactives. Il fait cela en transformant votre code au moment de la compilation, ce qui signifie que le code généré est allégé, sans runtime supplémentaire. Cela résout une problématique courante chez d’autres frameworks où la complexité du code peut affecter les performances de l’application. La force de Svelte réside également dans sa simplicité d’utilisation. Grâce à une syntaxe claire et intuitive, même les développeurs débutants peuvent rapidement comprendre et créer des applications sans être submergés par une multitude de configurations. La conception modulaire de ses composants permet de construire des interfaces utilisateur plus réactives et dynamiques, rendant l’expérience de développement fluide.",
                        "image":"data/img/svelte.png"
                    },
                    "backbone.js":{
                        "description":"Backbone.js structure les applications web en fournissant des modèles avec une liaison clé-valeur et des événements personnalisés, des collections avec une API riche de fonctions énumérables, des vues avec gestion déclarative des événements, et en connectant le tout à votre API existante sur une interface JSON RESTful. Le projet est hébergé sur GitHub, et que le code source annoté est disponible, ainsi qu’une suite de tests en ligne, un exemple d’application, une liste de tutoriels et une longue liste de projets du monde réel qui utilisent Backbone. Backbone peut être utilisé sous la licence logicielle MIT.",
                        "image":"data/img/backbone.png"
                    },
                    "vanilla.js":{
                        "description":"Vanilla JavaScript fait référence à un code JavaScript pur, ce qui signifie qu’il ne contient pas de bibliothèques ou de cadres supplémentaires comme jQuery, ce qui en fait une forme pure et fondamentale du langage de programmation Javascript. Rapide, léger et multiplateforme, il peut vous aider à créer des applications incroyablement puissantes et des pages web dynamiques. Les développeurs ont souvent le choix entre utiliser la bibliothèque JavaScript ou la créer de toutes pièces. En effet, les bibliothèques disposent de fonctions et d’outils prêts à l’emploi qui accélèrent le développement d’applications web.",
                        "image":"data/img/vanillajs.png"
                    }
                }
            },
            "css":{
                "framework":{
                    "bootstrap":{
                        "description":"Bootstrap est une collection d'outils utiles à la création du design (graphisme, animation et interactions avec la page dans le navigateur, etc.) de sites et d'applications web. C'est un ensemble qui contient des codes HTML et CSS, des formulaires, boutons, outils de navigation et autres éléments interactifs, ainsi que des extensions JavaScript en option. C'est l'un des projets les plus populaires sur la plate-forme de gestion de développement GitHub.",
                        "image":"data/img/bootstrap.png"
                    },
                    "foundation":{
                        "description":"Foundation est un framework front-end réactif gratuit, fournissant une grille réactive et des composants d’interface utilisateur HTML et CSS, des modèles et des extraits de code, y compris la typographie, les formulaires, les boutons, la navigation et d’autres éléments d’interface, ainsi que des fonctionnalités facultatives fournies par les extensions JavaScript. Foundation est un projet open source, et était auparavant maintenu par ZURB. Depuis 2019, la Fondation est entretenue par des bénévoles.",
                        "image":"data/img/foundation.png"
                    },
                    "less":{
                        "description":"Less.js est un préprocesseur CSS qui étend les fonctionnalités de CSS en ajoutant des éléments tels que les variables, les mixin, et les fonctions. Il permet de créer des feuilles de style dynamiques et de réduire la répétition, facilitant ainsi la maintenance et l'extension des styles. Less.js peut être exécuté soit côté client, soit côté serveur, ce qui améliore la performance des sites web.",
                        "image":"data/img/less.png"
                    },
                    "sass":{
                        "description":"Sass (Syntactically awesome stylesheets) est un langage de script préprocesseur qui est compilé ou interprété en CSS (Cascading Style Sheets). SassScript est le langage de script en lui-même. Sass est disponible en deux syntaxes. La syntaxe originale, appelée « syntaxe indentée » qui utilise l'indentation pour séparer les blocs de code et les sauts de ligne pour les séparer des directives. La nouvelle syntaxe, « SCSS », utilise les mêmes séparateurs de blocs que CSS. Les fichiers de la syntaxe indentée et SCSS utilisent respectivement les extensions .sass et .scss.",
                        "image":"data/img/sass.png"
                    }
                }
            },
            "html":{
                "framework":{
                    "bootstrap":{
                        "description":"A popular front-end framework for developing responsive and mobile-first websites.",
                        "image":"path/to/image.png"
                    },
                    "foundation":{
                        "description":"A responsive front-end framework similar to Bootstrap.",
                        "image":"path/to/image.png"
                    }
                }
            },
            "java":{
                "GWT":{
                    "description":"A development toolkit for building and optimizing complex browser-based applications.",
                    "image":"path/to/image.png"
                },
                "JSF":{
                    "description":"A framework that allows Java code to be compiled into JavaScript.",
                    "image":"path/to/image.png"
                },
                "Java FX":{
                    "description":"A platform for creating and delivering desktop applications with rich content.",
                    "image":"path/to/image.png"
                },
                "Vaadin":{
                    "description":"A platform for building web applications in Java.",
                    "image":"path/to/image.png"
                }
            },
            "c#":{
                "blazor":{
                    "description":"A framework for building interactive web UIs using C#.",
                    "image":"path/to/image.png"
                }
            },
            "elm":{
                "description":"A functional language that compiles to JavaScript.",
                "image":"path/to/image.png"
            }
        },
        "design":{
            "UI/UX design":{
                "Wireframes":{
                    "Figma":{
                        "description":"A web-based design tool for interface design and prototyping.",
                        "image":"path/to/image.png"
                    },
                    "Adobe XD":{
                        "description":"A vector-based user experience design tool for web apps and mobile apps.",
                        "image":"path/to/image.png"
                    },
                    "Balsamiq":{
                        "description":"A rapid wireframing tool that helps you work faster & smarter.",
                        "image":"path/to/image.png"
                    },
                    "Sketch":{
                        "description":"A digital design app for macOS focused on user interface and user experience design.",
                        "image":"path/to/image.png"
                    },
                    "InVision":{
                        "description":"A digital product design platform used to make prototypes, collaborate, and manage design projects.",
                        "image":"path/to/image.png"
                    }
                }
            }
        }
    },
    "DEV BACK END":{
        "Serveur Web":{
            "Nginx":{
                "description":"A high-performance web server and reverse proxy server.",
                "image":"path/to/image.png"
            },"Apache":{
                "description":"A widely-used open source web server software.",
                "image":"path/to/image.png"
    
            },"Caddy":{
                "description":"An open-source web server with automatic HTTPS.",
                "image":"path/to/image.png"
            }
        },
        "Serveur d'application Linux":{
            "Java":{
                "Webssphere":{
                    "description":"An application server for building and managing Java EE applications.",
                    "image":"path/to/image.png"
                },"Weblogic":{
                    "description":"A Java EE application server currently developed by Oracle Corporation.",
                    "image":"path/to/image.png"
                },"Wildfly":{
                    "description":"A flexible, lightweight, managed application runtime that helps you build amazing applications.",
                    "image":"path/to/image.png"
                    
                },"WildflyTomcat":{
                    "description":"An open-source implementation of the Java Servlet, JavaServer Pages, Java Expression Language and Java WebSocket technologies.",
                    "image":"path/to/image.png"
                  ,  },"Glassfish":{
                    "description":"An open-source application server project for the Java EE platform.",
                    "image":"path/to/image.png"

                  }
            }
        },
        "PHP":{
            "XAMPP":{
                "description":"A free and open-source cross-platform web server solution stack package.",
                "image":"path/to/image.png",
            
            },"WAMP Serveur":{
                "description":"A Windows web development environment that allows you to create web applications with Apache2, PHP and a MySQL database.",
                "image":"path/to/image.png"
        }
    },
    "LAMP Stack":{
            "description":"A popular open-source web development stack consisting of Linux, Apache, MySQL, and PHP.",
            "image":"path/to/image.png"
        

    },
    "Dev":{
        "Langages de programmation":{
            "Rust":{
                "Axum":{
                    "description":"A web application framework for Rust.",
                    "image":"path/to/image.png"
                },
                "Actix-web":{
                    "description":"A powerful, pragmatic, and extremely fast web framework for Rust.",
                    "image":"path/to/image.png"
                },
                "Rocket":{
                    "description":"A web framework for Rust that makes it simple to write fast web applications.",
                    "image":"path/to/image.png"
                }
            },
            "Python":{
                "framework":{
                    "Django":{
                        "description":"A high-level Python web framework that encourages rapid development and clean, pragmatic design.",
                        "image":"path/to/image.png"
                    },
                    "Flask":{
                        "description":"A lightweight WSGI web application framework in Python.",
                        "image":"path/to/image.png"
                    },
                    "FastAPI":{
                        "description":"A modern, fast (high-performance), web framework for building APIs with Python 3.6+ based on standard Python type hints.",
                        "image":"path/to/image.png"
                    }
                },
                "Tornado":{
                    "description":"A scalable, non-blocking web server and web application framework for Python.",
                    "image":"path/to/image.png"
                },
                "CherryPy":{
                    "description":"A minimalist Python web framework.",
                    "image":"path/to/image.png"
                
                },
                "C++":{
                    "Qt":{
                        "description":"A free and open-source widget toolkit for creating graphical user interfaces as well as cross-platform applications.",
                        "image":"path/to/image.png"
                    },
                    "wxWidgets":{
                        "description":"A C++ library that lets developers create applications for Windows, macOS, Linux and other platforms with a single code base.",
                        "image":"path/to/image.png"
                    },
                    "ImGUI":{
                        "description":"A bloat-free graphical user interface library for C++.",
                        "image":"path/to/image.png"
                    },
                    
                },
                "Kotlin":{
                    "Ktor":{
                        "description":"A framework for building asynchronous servers and clients in connected systems using the powerful Kotlin programming language.",
                        "image":"path/to/image.png"
                    },
                    "Micronaut":{
                        "description":"A modern, JVM-based, full-stack framework for building modular, easily testable microservice and serverless applications.",
                        "image":"path/to/image.png"

                    },
                    "Quarkus":{
                        "description":"A Kubernetes-native Java framework tailored for GraalVM and OpenJDK HotSpot, crafted from the best of breed Java libraries and standards.",
                        "image":"path/to/image.png"
                    },
                    "Spring Framework":{
                        "description":"A powerful, feature-rich framework for building Java applications, including web applications and microservices.",
                        "image":"path/to/image.png"
                    },
                
                
                "PHP":{
                    "Framework":{
                        "Symfony":{
                            "description":"A set of reusable PHP components and a PHP framework for web projects.",
                            "image":"path/to/image.png"
                        },
                        "Laravel":{
                            "description":"A web application framework with expressive, elegant syntax.",
                            "image":"path/to/image.png"
                        },
                        "CodeIgniter":{
                            "description":"A powerful PHP framework with a very small footprint, built for developers who need a simple and elegant toolkit to create full-featured web applications.",
                            "image":"path/to/image.png"

                        },
                        "Laminas":{
                            "description":"An open-source PHP framework for developing web applications and services.",
                            "image":"path/to/image.png"
                        },
                        "CakePHP":{
                            "description":"A rapid development framework for PHP that provides an extensible architecture for developing, maintaining, and deploying applications.",
                            "image":"path/to/image.png"
                        },
                        "CakePHP":{
                            "description":"A rapid development framework for PHP that provides an extensible architecture for developing, maintaining, and deploying applications.",
                            "image":"path/to/image.png"
                        },
                        "Yii":{
                            "description":"A high-performance PHP framework best for developing web 2.0 applications.",
                            "image":"path/to/image.png"
                        },


                    "CMS":{
                        "CMS e-commerce":{
                            "Shopify":{
                                "description":"A proprietary e-commerce platform for online stores and retail point-of-sale systems.",
                                "image":"path/to/image.png"
                            },
                            "Magento":{
                                "description":"An open-source e-commerce platform written in PHP.",
                                "image":"path/to/image.png"
                            },
                            "PrestaShop":{
                                "description":"An open-source e-commerce solution.",
                                "image":"path/to/image.png"
                            }
                         },

                    "WordPress":{
                        "description":"A free and open-source content management system (CMS) based on PHP and MySQL.",
                        "image":"path/to/image.png"
                    },
                    "Drupal":{
                        "description":"An open-source content management framework written in PHP.",
                        "image":"path/to/image.png"
                    },
                         
                               
                